# -*- coding: utf-8 -*-
from room_1 import folks as f1
from room_2 import folks as f2

# Вывести на консоль жителей комнат (модули room_1 и room_2)
# Формат: В комнате room_1 живут: ...


print('В первой комнате живут', ', '.join(f1), '.А в другой комнате', ','.join(f2))

# зачёт! 🚀
